<h1>
   <font color = "grey">Fundamentos da linguagem Python</font>
</h1>

# MÓDULO 1

## 1.1. Operadores matemáticos

In [326]:
# adição 

5 + 7

12

In [327]:
# subtração 

21 - 9

12

In [328]:
# multiplicação 

3 * 9

27

In [329]:
# divisão

59 / 3

19.666666666666668

### 1.1.1. Operação com variáveis

In [330]:
a = 39

In [331]:
b = a + 1

In [332]:
b

40

In [333]:
b * 2

80

**Aquecimento operadores matemáticos**

In [334]:
# compras 


arroz = 10
leite = 11.50
carne = 30.80
sabonete = 9.56
alvejante = 19.58

In [335]:
resultado = arroz + leite + carne + sabonete + alvejante

In [336]:
resultado

81.44

In [337]:
print('O valor total das compras é: R$', resultado)

O valor total das compras é: R$ 81.44

In [338]:
# potenciação 

2 ** 2

4

In [339]:
# módulo ou resto da divisão 

10 % 7

3

## 1.2. Operadores relacionais

In [340]:
# igualdade

700 == 90

False

In [341]:
100 == 100

True

In [342]:
80.0 == 80

True

In [343]:
# desigualdade 

3 != 7

True

In [344]:
3 != 3

False

In [345]:
# maior que 

500 > 90

True

In [346]:
90 > 500

False

In [347]:
# menor que 

500 < 90

False

In [348]:
90 < 500

True

In [349]:
# maior ou igual 

8 >= 8

True

In [350]:
5 >= 10

False

## 1.3. Operadores lógicos

**and** = e

**or** = ou 

**not** = não

**and** = se todas as alternativas forem verdadeiras

**or** = se pelo menos uma das alternativas forem verdadeiras

**not** = se for verdadeira será falso

**1.Para estudar em uma universidade, o aluno deve:**


Ter passado no vestibular

e

Estar com toda documentação necessária

e 

Estar matriculado

In [351]:
50 > 40 and 50 > 49

True

**2. Para obter flexibilidade no período de provas, o aluno deve:**

Ser militar e estar de serviço

ou 

Estar de licença maternidade

ou 

Estar de atestado médico

In [352]:
80 > 3 or 15 > 20

True

## 1.4. Laços de repetiçoes for

In [353]:
for i in range (0, 20, 3):
    print(i)

0
3
6
9
12
15
18

Essa função cria um loop de um range(sequencia numerica) 

for é função (i) é a variável in conecta ao range ( inicio da sequncia, fim da sequencia, intervalos)

In [354]:
lista = [3, 8, 44, 100]

In [355]:
for x in lista:
    print(x)

3
8
44
100

In [356]:
lista2 = [3, 8, 44, 100]

In [357]:
for i in lista2:
    
    if i % 2 == 0:
     print(i)

8
44
100

In [358]:
lista3 = [ [1,2,3], [2,3,5], [7,8,5,4,3,2] ]

In [359]:
for ii in lista3:
    print(ii)

[1, 2, 3]
[2, 3, 5]
[7, 8, 5, 4, 3, 2]

In [360]:
di = {'d1': 10,'d2': 20,'d3': 30,'d4': 40,'d5': 50, };

d2 = {'d2': 10,'d2': 20,'d2': 30,'d2': 40,'d2': 50};

In [361]:
di

{'d1': 10, 'd2': 20, 'd3': 30, 'd4': 40, 'd5': 50}

In [362]:
for i in di:
    print(i)

d1
d2
d3
d4
d5

In [363]:
di.items()

dict_items([('d1', 10), ('d2', 20), ('d3', 30), ('d4', 40), ('d5', 50)])

In [364]:
for c, v, in di.items():
    print( c, v)

d1 10
d2 20
d3 30
d4 40
d5 50

## 1.5. Laços de repetiçoes whille(enquanto)

In [365]:
k = 8

while k <= 10:
    print(k)
    
    k += 1

8
9
10

**pass, break e continue**

In [366]:
for letra in 'programador':
    if letra == 'a':
        pass
    print(letra)

p
r
o
g
r
a
m
a
d
o
r

In [367]:
for letra in 'programador':
    if letra == 'a':
        continue
    print(letra)

p
r
o
g
r
m
d
o
r

In [368]:
for letra in 'programador':
    if letra == 'a':
        break
    print(letra)

p
r
o
g
r

## 1.6. Funções

In [369]:
 def print_text():
    print('Aqui é um texto qaulquer')

In [370]:
print_text()

Aqui é um texto qaulquer

In [371]:
def print_isto(x):
    print(x)

In [372]:
print_isto(7958)

7958

In [373]:
def potencia(x):
    p = x ** 2
    return p

In [374]:
potencia(4)

16

In [375]:
def sub(x):
    r = x + 4
    return r

In [376]:
sub (1000)

1004

In [377]:
def potencia_n(x, n = 2 ):
    p = x ** n
    return p

In [378]:
potencia_n(5)

25

In [379]:
potencia_n(5, 3)

125

# MÓDULO 2

### IMPORTS

In [380]:
import pandas as pd
import numpy as np

## 2.1. Dataframes

In [381]:
series = pd.Series([7, 4, 2, np.nan, 6, 9 ])

In [382]:
series

0    7.0
1    4.0
2    2.0
3    NaN
4    6.0
5    9.0
dtype: float64

In [383]:
type(series)

pandas.core.series.Series

In [384]:
datas = pd.date_range('20220101', periods = 6 )

In [385]:
datas

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [386]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [387]:
df = pd.DataFrame(np.random.randn(6,4), index= datas, columns = list('ABCD'))

In [388]:
df

                   A         B         C         D
2022-01-01 -2.051975  0.752461 -2.065874 -0.657351
2022-01-02  0.588058  0.886433 -0.051583  0.491012
2022-01-03  0.706694  0.947890  0.245954 -2.345500
2022-01-04  0.580628 -0.270224 -0.216148  0.509481
2022-01-05  0.752368 -1.289725  0.003071 -0.089378
2022-01-06  0.273114  1.738508 -0.259484  0.496839

In [389]:
df2 = pd.DataFrame({'A': 7,
                    'B': pd.Timestamp('20220101'),
                    'C': pd.Series(1, index=list(range(4)), dtype = 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'), 
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'})

In [390]:
df2

   A          B    C  D      E       F
0  7 2022-01-01  1.0  3   test  Python
1  7 2022-01-01  1.0  3  train  Python
2  7 2022-01-01  1.0  3   test  Python
3  7 2022-01-01  1.0  3  train  Python

In [391]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## 2.2. Merge

In [392]:
# Cadastro da loja a
cadastro_a = {'Id': ['AA2930','BB4563','CC2139','DE2521','GT3462','HH1158'],
            'Nome':  ['Victor', 'Amanda', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
            'Idade': [20,35,40,54,30,27],
            'CEP': ['00092-029','11111-111','22222-888','00000-999','88888-111','77777-666']
           }

cadastro_a = pd.DataFrame(cadastro_a, columns = ['Id','Nome','Idade','CEP'])
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [393]:
# Cadastro da loja b
cadastro_b = {'Id': ['CC9999','EF4488','DD9999','GT3462','HH1158'],
            'Nome':  ['Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria'],
            'Idade': [19,30,22,30,27],
            'CEP': ['00092-029','11111-111','11111-888','88888-111','77777-666']
           }
 
cadastro_b = pd.DataFrame(cadastro_b, columns = ['Id','Nome','Idade','CEP'])
cadastro_b

       Id      Nome  Idade        CEP
0  CC9999    Marcos     19  00092-029
1  EF4488  Patricia     30  11111-111
2  DD9999    Ericka     22  11111-888
3  GT3462   Ricardo     30  88888-111
4  HH1158     Maria     27  77777-666

In [394]:
# Registro de compras de todas unidades
compras = {'Id': ['AA2930','EF4488','CC2139','EF4488','CC9999','AA2930','HH1158','HH1158'],
            'Data':  ['2019-01-01','2019-01-30','2019-01-30','2019-02-01','2019-02-20','2019-03-15','2019-04-01','2019-04-10'],
            'Valor': [200,100,40,150,300,25,50,500]
           }
 
compras = pd.DataFrame(compras, columns = ['Id','Data','Valor'])

compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

* Merge **inner join** junta a interceção entre as tabelas

In [395]:
pd.merge(cadastro_a, cadastro_b[['Id', 'Idade', 'CEP']], on= ['Id'], how='inner', suffixes= ('_A', '_B'))

       Id     Nome  Idade_A      CEP_A  Idade_B      CEP_B
0  GT3462  Ricardo       30  88888-111       30  88888-111
1  HH1158    Maria       27  77777-666       27  77777-666

* Merge **full join** junta a todas as informações das tabelas

In [396]:
lojas = pd.concat([cadastro_a, cadastro_b], ignore_index= True)

In [397]:
clientes_unicos = lojas.drop_duplicates(subset=['Id'])

In [398]:
clientes_unicos

       Id      Nome  Idade        CEP
0  AA2930    Victor     20  00092-029
1  BB4563    Amanda     35  11111-111
2  CC2139     Bruna     40  22222-888
3  DE2521    Carlos     54  00000-999
4  GT3462   Ricardo     30  88888-111
5  HH1158     Maria     27  77777-666
6  CC9999    Marcos     19  00092-029
7  EF4488  Patricia     30  11111-111
8  DD9999    Ericka     22  11111-888

* Merge **left join** junta informações do lado esquerdo da tabela

In [399]:
esquerda = pd.merge(cadastro_a, compras, how='left', on=['Id'])

In [400]:
compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

In [401]:
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [402]:
esquerda

       Id     Nome  Idade        CEP        Data  Valor
0  AA2930   Victor     20  00092-029  2019-01-01  200.0
1  AA2930   Victor     20  00092-029  2019-03-15   25.0
2  BB4563   Amanda     35  11111-111         NaN    NaN
3  CC2139    Bruna     40  22222-888  2019-01-30   40.0
4  DE2521   Carlos     54  00000-999         NaN    NaN
5  GT3462  Ricardo     30  88888-111         NaN    NaN
6  HH1158    Maria     27  77777-666  2019-04-01   50.0
7  HH1158    Maria     27  77777-666  2019-04-10  500.0

In [403]:
esquerda.groupby(['Id', 'Nome'])['Valor'].sum()

Id      Nome
AA2930  Victor     225.0
BB4563  Amanda       0.0
CC2139  Bruna       40.0
DE2521  Carlos       0.0
GT3462  Ricardo      0.0
HH1158  Maria      550.0
Name: Valor, dtype: float64

## 2.3. Groupby

In [404]:
dfg = pd.DataFrame({'A': ['verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso'],
                    
                    'B': ['um', 'um', 'dois', 'tres', 'dois', ' dois', 'um ', 'tres'],
                    
                    'C': np.random.randn(8),
                    
                    'D': np.random.randn(8)})

In [405]:
dfg

            A      B         C         D
0  verdadeiro     um  1.702891 -1.644407
1       falso     um -1.325091 -0.795486
2  verdadeiro   dois  1.274289  0.822244
3       falso   tres  0.429365  0.482464
4  verdadeiro   dois -1.587241  2.802827
5       falso   dois -1.377658 -1.588280
6  verdadeiro    um  -0.511941 -0.411800
7       falso   tres  0.345326  1.260844

#### Soma dos valores das colunas baseada na coluna A

In [406]:
dfg.groupby(['A']).sum()

                   C         D
A
falso      -1.928058 -0.640457
verdadeiro  0.877998  1.568865

#### Média dos valores das colunas baseada na coluna A

In [407]:
dfg.groupby(['A']).mean()

                   C         D
A
falso      -0.482014 -0.160114
verdadeiro  0.219500  0.392216

#### Soma dos valores das colunas baseada na coluna B

In [408]:
dfg.groupby(['B']).sum()

              C         D
B
 dois -1.377658 -1.588280
dois  -0.312952  3.625071
tres   0.774691  1.743308
um     0.377800 -2.439893
um    -0.511941 -0.411800

#### Média dos valores das colunas baseada na coluna B

In [409]:
dfg.groupby(['B']).mean()

              C         D
B
 dois -1.377658 -1.588280
dois  -0.156476  1.812536
tres   0.387346  0.871654
um     0.188900 -1.219946
um    -0.511941 -0.411800

#### Soma dos valores das colunas baseada nas colunas A e B

In [410]:
dfg.groupby(['A','B']).sum()

                         C         D
A          B
falso       dois -1.377658 -1.588280
           tres   0.774691  1.743308
           um    -1.325091 -0.795486
verdadeiro dois  -0.312952  3.625071
           um     1.702891 -1.644407
           um    -0.511941 -0.411800

## 2.4. Indexação

Todo índice em pyhon inicia em 0.

Sempre que quisermos selecionar algum objeto em uma lista, devemos considerar esse requisito.

In [411]:
lista = [ 32, 96, 11, 27]

In [412]:
lista[0]

32

Sempre que quisermos selecionar os números de trás pra frente, basta adicionar o sinal de subtração e ordenar a casa

In [413]:
lista [-1]

27

### Indexação múltlipla

In [414]:
arrays = [[1, 2, 5, 4], ['red', 'blue', 'green', 'blue']]

In [415]:
pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))

MultiIndex([(1,   'red'),
            (2,  'blue'),
            (5, 'green'),
            (4,  'blue')],
           names=['number', 'color'])

In [416]:
numbers = [0, 1, 2]
colors = ['green', 'purple']

**MultiIndex com produto cartesiano**

In [417]:
pd.MultiIndex.from_product([numbers, colors], names = ['number', 'color'])

MultiIndex([(0,  'green'),
            (0, 'purple'),
            (1,  'green'),
            (1, 'purple'),
            (2,  'green'),
            (2, 'purple')],
           names=['number', 'color'])

## 2.5. Reshping dados

In [418]:
datas = pd.date_range('20220101', periods= 6 )

df = pd.DataFrame(np.random.randn(6, 4), index = datas, columns = ['var_A', 'var_B', 'var_C', 'var_D'])

In [419]:
df

               var_A     var_B     var_C     var_D
2022-01-01 -0.158656  0.478816  1.401692  0.661835
2022-01-02  0.165559  0.719722  0.350317  1.171678
2022-01-03 -0.195197  0.949699 -0.740420  0.597797
2022-01-04 -0.056274  0.784752  0.208651 -0.124675
2022-01-05  0.752890  1.006933  0.855658 -2.162493
2022-01-06  1.009205  0.181378  0.358558  0.735409

In [420]:
dft = df.T

In [421]:
dft

       2022-01-01  2022-01-02  2022-01-03  2022-01-04  2022-01-05  2022-01-06
var_A   -0.158656    0.165559   -0.195197   -0.056274    0.752890    1.009205
var_B    0.478816    0.719722    0.949699    0.784752    1.006933    0.181378
var_C    1.401692    0.350317   -0.740420    0.208651    0.855658    0.358558
var_D    0.661835    1.171678    0.597797   -0.124675   -2.162493    0.735409

In [422]:
df.shape

(6, 4)

### 2.5.1. Função pivot

In [423]:
data = pd.date_range('20220101', periods= 12 )

pessoa = ['George', 'Victor', 'Lucas']

In [424]:
data

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12'],
              dtype='datetime64[ns]', freq='D')

In [425]:
nome = []

gasto = []

for i in range(12):
    nome.append(np.random.choice(pessoa))
    gasto.append(np.round(np.random.randn()*100,2 ))
    
    nome

In [426]:
df = pd.DataFrame({'Data': data, 'Nome': nome, 'Gasto': gasto})

In [427]:
df

         Data    Nome   Gasto
0  2022-01-01  George   37.51
1  2022-01-02  George  -12.73
2  2022-01-03  Victor   71.21
3  2022-01-04  George  -94.79
4  2022-01-05   Lucas -256.38
5  2022-01-06  George   28.21
6  2022-01-07   Lucas  206.61
7  2022-01-08  George  -24.84
8  2022-01-09  George   16.53
9  2022-01-10  George  220.87
10 2022-01-11  Victor -165.13
11 2022-01-12   Lucas  282.64

In [428]:
pd.pivot(df, index= 'Data', columns= 'Nome', values= 'Gasto')

Nome        George   Lucas  Victor
Data
2022-01-01   37.51     NaN     NaN
2022-01-02  -12.73     NaN     NaN
2022-01-03     NaN     NaN   71.21
2022-01-04  -94.79     NaN     NaN
2022-01-05     NaN -256.38     NaN
2022-01-06   28.21     NaN     NaN
2022-01-07     NaN  206.61     NaN
2022-01-08  -24.84     NaN     NaN
2022-01-09   16.53     NaN     NaN
2022-01-10  220.87     NaN     NaN
2022-01-11     NaN     NaN -165.13
2022-01-12     NaN  282.64     NaN

### 2.5.2. Função pivot table

In [429]:
carros = [7, 4, 3, 2, 8]

data = pd.date_range('20220101','20220101', periods= 5 )

vendedor = ['George', 'Vagner', 'Pedro', 'Vagner', 'George']

In [430]:
df = pd.DataFrame({'Vendas': carros, 'Data': data, 'Vendedor': vendedor})

In [431]:
df

   Vendas       Data Vendedor
0       7 2022-01-01   George
1       4 2022-01-01   Vagner
2       3 2022-01-01    Pedro
3       2 2022-01-01   Vagner
4       8 2022-01-01   George

A função **pivot table** não entrega valores de index duplicados

In [432]:
pd.pivot_table(df, index= 'Data', columns= 'Vendedor', values= 'Vendas', aggfunc='sum')

Vendedor    George  Pedro  Vagner
Data
2022-01-01      15      3       6

### 2.5.3. Stack e unstack de dados

coleta de dados da internet

In [433]:
df = pd.read_csv('https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv')

In [434]:
df.head(4)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0

In [435]:
df.shape

(458, 9)

In [436]:
#Essa função empilha os dados em uma coluna

empilhamento = df.stack()

In [437]:
empilhamento.head(20)

0  Name         Avery Bradley
   Team        Boston Celtics
   Number                 0.0
   Position                PG
   Age                   25.0
   Height                 6-2
   Weight               180.0
   College              Texas
   Salary           7730337.0
1  Name           Jae Crowder
   Team        Boston Celtics
   Number                99.0
   Position                SF
   Age                   25.0
   Height                 6-6
   Weight               235.0
   College          Marquette
   Salary           6796117.0
2  Name          John Holland
   Team        Boston Celtics
dtype: object

In [438]:
# Essa função reverte o processo de empilhamento

empilhamento.unstack()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

### 2.5.4. Função melt

In [439]:
df = pd.DataFrame({ 'A': {0: 'a', 1: 'b', 2: 'c'},
                    'B': {0: 1, 1: 3, 2: 5,},
                    'C': {0: 2, 1: 4, 2: 6}})

In [440]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [441]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [442]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [443]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'], var_name='nome da var', value_name='valor da var')

   A nome da var  valor da var
0  a           B             1
1  b           B             3
2  c           B             5
3  a           C             2
4  b           C             4
5  c           C             6

In [444]:
data = {
    'Localização' : ['cidadeA', 'cidadeB'], 
    'Temperatura' : ['prevista', 'atual'],
    'Set-2021':     [30, 32],
    'Out-2021':     [45, 43],
    'Nov-2021':     [24, 22]
}

print(data)

{'Localização': ['cidadeA', 'cidadeB'], 'Temperatura': ['prevista', 'atual'], 'Set-2021': [30, 32], 'Out-2021': [45, 43], 'Nov-2021': [24, 22]}

In [445]:
df = pd.DataFrame(data, columns = ['Localização', 'Temperatura', 'Set-2021', 'Out-2021', 'Nov-2021'])
df

  Localização Temperatura  Set-2021  Out-2021  Nov-2021
0     cidadeA    prevista        30        45        24
1     cidadeB       atual        32        43        22

In [446]:
df2 = pd.melt(df, id_vars=['Localização', 'Temperatura'], var_name='Data', value_name='Valor')

df2

  Localização Temperatura      Data  Valor
0     cidadeA    prevista  Set-2021     30
1     cidadeB       atual  Set-2021     32
2     cidadeA    prevista  Out-2021     45
3     cidadeB       atual  Out-2021     43
4     cidadeA    prevista  Nov-2021     24
5     cidadeB       atual  Nov-2021     22

## 2.6. Seleção de linhas e colunas

In [447]:
datas = pd.date_range('20210101', periods = 600)

df = pd.DataFrame(np.random.rand(600, 5), index = datas, columns = list('ABCDE'))

In [448]:
df.head(4)

                   A         B         C         D         E
2021-01-01  0.352651  0.898150  0.564599  0.288722  0.979851
2021-01-02  0.910355  0.718123  0.573570  0.976761  0.159610
2021-01-03  0.088129  0.932644  0.986273  0.197761  0.536170
2021-01-04  0.773962  0.494546  0.769361  0.240219  0.124083

In [449]:
df['D'].tail(5)

2022-08-19    0.090279
2022-08-20    0.673873
2022-08-21    0.980384
2022-08-22    0.290099
2022-08-23    0.321481
Freq: D, Name: D, dtype: float64

In [450]:
df[1 : 5]

                   A         B         C         D         E
2021-01-02  0.910355  0.718123  0.573570  0.976761  0.159610
2021-01-03  0.088129  0.932644  0.986273  0.197761  0.536170
2021-01-04  0.773962  0.494546  0.769361  0.240219  0.124083
2021-01-05  0.445809  0.596361  0.456387  0.569813  0.761558

In [451]:
df.loc[:, ['B', 'C', 'D']]

                   B         C         D
2021-01-01  0.898150  0.564599  0.288722
2021-01-02  0.718123  0.573570  0.976761
2021-01-03  0.932644  0.986273  0.197761
2021-01-04  0.494546  0.769361  0.240219
2021-01-05  0.596361  0.456387  0.569813
...              ...       ...       ...
2022-08-19  0.094518  0.542092  0.090279
2022-08-20  0.235773  0.991298  0.673873
2022-08-21  0.657153  0.172594  0.980384
2022-08-22  0.947313  0.728176  0.290099
2022-08-23  0.476882  0.528800  0.321481

[600 rows x 3 columns]

**Filtragem do intervalo entre as datas especificadas e das colunas A e C**

In [452]:
df.loc['20220101' : '20220323', ['A', 'C']].head(5)

                   A         C
2022-01-01  0.408671  0.055691
2022-01-02  0.847989  0.018251
2022-01-03  0.395713  0.209735
2022-01-04  0.400342  0.890596
2022-01-05  0.930228  0.545260

**Filtragem de todas as colunas da linha 1**

In [453]:
df.iloc[1]

A    0.910355
B    0.718123
C    0.573570
D    0.976761
E    0.159610
Name: 2021-01-02 00:00:00, dtype: float64

**Filtragem de um intervalo específico entre linhas e colunas (1º intervalo linhas, 2º colunas)**

In [454]:
df.iloc[1:4, 1: 6]

                   B         C         D         E
2021-01-02  0.718123  0.573570  0.976761  0.159610
2021-01-03  0.932644  0.986273  0.197761  0.536170
2021-01-04  0.494546  0.769361  0.240219  0.124083

**Filtragem de linhas e colunas escolhidas**

In [455]:
df.iloc[[7, 4, 8], [0, 3]]

                   A         D
2021-01-08  0.005503  0.102167
2021-01-05  0.445809  0.569813
2021-01-09  0.802038  0.388318

**Filtros booleanos**

In [456]:
df[df.A>0]

                   A         B         C         D         E
2021-01-01  0.352651  0.898150  0.564599  0.288722  0.979851
2021-01-02  0.910355  0.718123  0.573570  0.976761  0.159610
2021-01-03  0.088129  0.932644  0.986273  0.197761  0.536170
2021-01-04  0.773962  0.494546  0.769361  0.240219  0.124083
2021-01-05  0.445809  0.596361  0.456387  0.569813  0.761558
...              ...       ...       ...       ...       ...
2022-08-19  0.512019  0.094518  0.542092  0.090279  0.673846
2022-08-20  0.765809  0.235773  0.991298  0.673873  0.633129
2022-08-21  0.284893  0.657153  0.172594  0.980384  0.812061
2022-08-22  0.632548  0.947313  0.728176  0.290099  0.719946
2022-08-23  0.689757  0.476882  0.528800  0.321481  0.706119

[600 rows x 5 columns]

In [457]:
df[df > 0]

                   A         B         C         D         E
2021-01-01  0.352651  0.898150  0.564599  0.288722  0.979851
2021-01-02  0.910355  0.718123  0.573570  0.976761  0.159610
2021-01-03  0.088129  0.932644  0.986273  0.197761  0.536170
2021-01-04  0.773962  0.494546  0.769361  0.240219  0.124083
2021-01-05  0.445809  0.596361  0.456387  0.569813  0.761558
...              ...       ...       ...       ...       ...
2022-08-19  0.512019  0.094518  0.542092  0.090279  0.673846
2022-08-20  0.765809  0.235773  0.991298  0.673873  0.633129
2022-08-21  0.284893  0.657153  0.172594  0.980384  0.812061
2022-08-22  0.632548  0.947313  0.728176  0.290099  0.719946
2022-08-23  0.689757  0.476882  0.528800  0.321481  0.706119

[600 rows x 5 columns]

## 2.7. Limpeza dos dados

### 2.7.1 Sumarização dos dados

In [458]:
datas = pd.date_range('20180101', periods = 6)

df = pd.DataFrame(np.random.randn(6,4), index = datas, columns = ['var_A', 'var_B', 'var_C', 'var_D'])

In [459]:
df2 = pd.DataFrame({'A': pd.Timestamp('20130102'),
                    'B': pd.Series(1, index = list(range(4)), dtype= 'float32'),
                    'C': np.array([3] * 4, dtype = 'int32'),
                    'D': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'
    
})

In [460]:
df

               var_A     var_B     var_C     var_D
2018-01-01  0.272349 -2.422080 -0.775394  0.054546
2018-01-02  0.423027  0.880919 -0.103636 -1.026599
2018-01-03  0.769553 -2.167162 -1.406271 -0.254677
2018-01-04  1.717988 -0.619818 -1.845995 -0.474702
2018-01-05 -1.556300 -0.092958 -1.375232  0.080623
2018-01-06 -0.424508 -0.555368  0.890314  0.056659

In [461]:
df.shape

(6, 4)

In [462]:
df.dtypes

var_A    float64
var_B    float64
var_C    float64
var_D    float64
dtype: object

In [467]:
df.describe()

          var_A     var_B     var_C     var_D
count  6.000000  6.000000  6.000000  6.000000
mean   0.200352 -0.829411 -0.769369 -0.260692
std    1.109797  1.257998  1.012879  0.435668
min   -1.556300 -2.422080 -1.845995 -1.026599
25%   -0.250293 -1.780326 -1.398511 -0.419695
50%    0.347688 -0.587593 -1.075313 -0.100066
75%    0.682921 -0.208560 -0.271575  0.056131
max    1.717988  0.880919  0.890314  0.080623

In [463]:
df2

           A    B  C      D       F
0 2013-01-02  1.0  3   test  Python
1 2013-01-02  1.0  3  train  Python
2 2013-01-02  1.0  3   test  Python
3 2013-01-02  1.0  3  train  Python

In [464]:
df.shape

(6, 4)

In [465]:
df2.dtypes

A    datetime64[ns]
B           float32
C             int32
D          category
F            object
dtype: object

In [466]:
df2.describe()

         B    C
count  4.0  4.0
mean   1.0  3.0
std    0.0  0.0
min    1.0  3.0
25%    1.0  3.0
50%    1.0  3.0
75%    1.0  3.0
max    1.0  3.0

In [469]:
df

               var_A     var_B     var_C     var_D
2018-01-01  0.272349 -2.422080 -0.775394  0.054546
2018-01-02  0.423027  0.880919 -0.103636 -1.026599
2018-01-03  0.769553 -2.167162 -1.406271 -0.254677
2018-01-04  1.717988 -0.619818 -1.845995 -0.474702
2018-01-05 -1.556300 -0.092958 -1.375232  0.080623
2018-01-06 -0.424508 -0.555368  0.890314  0.056659

In [470]:
df1 = df.reindex(index = datas [ 0: 4 ], columns = list(df.columns) + ['var_E'])

In [471]:
df1

               var_A     var_B     var_C     var_D  var_E
2018-01-01  0.272349 -2.422080 -0.775394  0.054546    NaN
2018-01-02  0.423027  0.880919 -0.103636 -1.026599    NaN
2018-01-03  0.769553 -2.167162 -1.406271 -0.254677    NaN
2018-01-04  1.717988 -0.619818 -1.845995 -0.474702    NaN

In [473]:
df1.loc[datas[0]: datas [1], 'var_E'] = 77

In [474]:
df1

               var_A     var_B     var_C     var_D  var_E
2018-01-01  0.272349 -2.422080 -0.775394  0.054546   77.0
2018-01-02  0.423027  0.880919 -0.103636 -1.026599   77.0
2018-01-03  0.769553 -2.167162 -1.406271 -0.254677    NaN
2018-01-04  1.717988 -0.619818 -1.845995 -0.474702    NaN

In [475]:
df1.describe()

          var_A     var_B     var_C     var_D  var_E
count  4.000000  4.000000  4.000000  4.000000    2.0
mean   0.795729 -1.082035 -1.032824 -0.425358   77.0
std    0.649123  1.531889  0.759467  0.455838    0.0
min    0.272349 -2.422080 -1.845995 -1.026599   77.0
25%    0.385357 -2.230892 -1.516202 -0.612676   77.0
50%    0.596290 -1.393490 -1.090832 -0.364689   77.0
75%    1.006662 -0.244634 -0.607454 -0.177371   77.0
max    1.717988  0.880919 -0.103636  0.054546   77.0

### 2.7.2. Dados faltantes NaN

In [477]:
datas = pd.date_range('20180101', periods = 60, freq="D")

df = pd.DataFrame(np.random.randn(60,5), index = datas, columns = list("ABCDE"))

In [478]:
df.head(3)

                   A         B         C         D         E
2018-01-01 -0.243275  1.023423  1.099945  0.641441 -0.078567
2018-01-02  1.165914  0.286831  0.112713 -0.437959  1.483211
2018-01-03  1.453961 -0.315734 -1.317983 -0.865978  0.504871

In [479]:
df['F'] = df.A[df.A > 0]

In [492]:
df.head(3)

                   A         B         C         D         E         F
2018-01-01 -0.243275  1.023423  1.099945  0.641441 -0.078567       NaN
2018-01-02  1.165914  0.286831  0.112713 -0.437959  1.483211  1.165914
2018-01-03  1.453961 -0.315734 -1.317983 -0.865978  0.504871  1.453961

In [481]:
df1 = df.copy()

In [482]:
df2 = df.copy()

**Extração dos valores NaN. Sempre que ultilizamos este comando, também perdemos os demais dados da linha.**

In [494]:
df1.dropna().shape

(29, 6)

In [496]:
df.shape

(60, 6)

In [497]:
df2.head()

                   A         B         C         D         E         F
2018-01-01 -0.243275  1.023423  1.099945  0.641441 -0.078567       NaN
2018-01-02  1.165914  0.286831  0.112713 -0.437959  1.483211  1.165914
2018-01-03  1.453961 -0.315734 -1.317983 -0.865978  0.504871  1.453961
2018-01-04 -1.219427 -0.097393  0.637528 -0.871633 -0.122791       NaN
2018-01-05 -0.295831 -1.133522  0.839137 -1.653002 -0.619852       NaN

**Substituição dos valores NaN pela média da coluna F**

In [501]:
df2.F.fillna(np.mean(df2.F))

2018-01-01    0.989681
2018-01-02    1.165914
2018-01-03    1.453961
2018-01-04    0.989681
2018-01-05    0.989681
2018-01-06    0.514532
2018-01-07    0.989681
2018-01-08    1.189412
2018-01-09    0.989681
2018-01-10    0.989681
2018-01-11    1.889811
2018-01-12    0.989681
2018-01-13    2.138762
2018-01-14    0.989681
2018-01-15    0.077687
2018-01-16    0.989681
2018-01-17    0.989681
2018-01-18    0.989681
2018-01-19    1.375396
2018-01-20    0.989681
2018-01-21    0.989681
2018-01-22    1.128922
2018-01-23    0.989681
2018-01-24    0.989681
2018-01-25    0.989681
2018-01-26    0.449766
2018-01-27    0.584395
2018-01-28    0.989681
2018-01-29    0.989681
2018-01-30    0.989681
2018-01-31    0.989681
2018-02-01    0.989681
2018-02-02    1.653703
2018-02-03    0.989681
2018-02-04    0.369417
2018-02-05    0.989681
2018-02-06    0.740469
2018-02-07    1.476626
2018-02-08    0.284185
2018-02-09    0.386475
2018-02-10    0.918979
2018-02-11    0.199568
2018-02-12    1.533476
2018-02-13    0.644946
2018-02-14    0.989681
2018-02-15    0.989681
2018-02-16    0.989681
2018-02-17    0.989681
2018-02-18    1.258097
2018-02-19    1.422132
2018-02-20    0.989681
2018-02-21    2.495601
2018-02-22    1.492576
2018-02-23    0.226564
2018-02-24    1.162309
2018-02-25    0.989681
2018-02-26    0.005890
2018-02-27    0.989681
2018-02-28    0.989681
2018-03-01    0.461175
Freq: D, Name: F, dtype: float64

In [502]:
df3 = df.copy()

**Substituição de TODOS os valores NaN da tabela por 777**

In [503]:
df3.fillna(value = 777)

                   A         B         C         D         E           F
2018-01-01 -0.243275  1.023423  1.099945  0.641441 -0.078567  777.000000
2018-01-02  1.165914  0.286831  0.112713 -0.437959  1.483211    1.165914
2018-01-03  1.453961 -0.315734 -1.317983 -0.865978  0.504871    1.453961
2018-01-04 -1.219427 -0.097393  0.637528 -0.871633 -0.122791  777.000000
2018-01-05 -0.295831 -1.133522  0.839137 -1.653002 -0.619852  777.000000
2018-01-06  0.514532 -0.639250 -0.905279 -1.031057 -0.963833    0.514532
2018-01-07 -0.492554 -1.731519  0.316311 -0.972007  0.535672  777.000000
2018-01-08  1.189412 -1.223022  2.410446 -1.215531 -0.244264    1.189412
2018-01-09 -0.430046  0.867390 -0.278120  0.142889  0.321740  777.000000
2018-01-10 -1.069312 -0.258149  0.537811  2.071838 -0.868362  777.000000
2018-01-11  1.889811  0.195986 -2.393781 -0.595883  0.195737    1.889811
2018-01-12 -2.126752 -2.570862  1.994686  1.482864  1.541486  777.000000
2018-01-13  2.138762 -0.713856 -1.287635  0.920930  0.339894    2.138762
2018-01-14 -1.771179 -0.408990 -1.954981 -0.656902 -0.689228  777.000000
2018-01-15  0.077687  1.326231  1.541098 -0.715466 -0.803941    0.077687
2018-01-16 -0.826072 -0.378462 -1.242613  0.047004  0.015180  777.000000
2018-01-17 -0.068147 -1.331626 -0.997072 -0.334471 -0.328547  777.000000
2018-01-18 -0.366564 -0.080127  0.359940 -2.769615  0.568383  777.000000
2018-01-19  1.375396 -0.229429 -1.202174  0.645407 -0.697031    1.375396
2018-01-20 -0.278737  0.142168  0.826357  0.670507  0.957789  777.000000
2018-01-21 -0.065288  1.309915  1.615753  0.344144 -0.290288  777.000000
2018-01-22  1.128922 -0.350688 -1.249620 -0.499215 -1.095385    1.128922
2018-01-23 -1.378218 -0.340986 -2.269798  0.238190  1.865634  777.000000
2018-01-24 -0.663825 -0.916559  0.438594  1.090096 -1.360447  777.000000
2018-01-25 -1.031092  0.894287 -0.499995  1.195302 -1.465248  777.000000
2018-01-26  0.449766  0.750124  0.687684 -0.537464  2.272422    0.449766
2018-01-27  0.584395  0.014630  0.726956  0.317921 -1.536554    0.584395
2018-01-28 -1.937058  0.362683 -1.646891 -0.217799 -0.104436  777.000000
2018-01-29 -0.681629 -1.023435 -0.863146 -0.860831  1.384267  777.000000
2018-01-30 -0.522082 -0.040951 -0.461775 -1.553476 -0.363574  777.000000
2018-01-31 -1.530968 -1.016334 -0.292733  0.089999  1.163200  777.000000
2018-02-01 -2.445072  1.503129  0.654391  0.936095 -0.918169  777.000000
2018-02-02  1.653703 -0.480537 -1.367424  0.055547 -1.249835    1.653703
2018-02-03 -0.449595 -0.614311 -1.370638  0.322324  0.629697  777.000000
2018-02-04  0.369417  0.058998  0.096490  1.536826  0.951632    0.369417
2018-02-05 -1.028599  1.091963  0.762481 -1.634211  0.068829  777.000000
2018-02-06  0.740469 -0.519450 -0.257231 -1.469172  0.913089    0.740469
2018-02-07  1.476626 -2.015347  1.100768 -0.678735 -0.795247    1.476626
2018-02-08  0.284185 -0.642581 -1.378474  0.476508 -0.423130    0.284185
2018-02-09  0.386475  0.290592 -1.128228  2.137339 -2.091565    0.386475
2018-02-10  0.918979  2.035231  0.399610 -0.639993 -3.125266    0.918979
2018-02-11  0.199568  0.193646 -2.048909  1.792119 -0.026167    0.199568
2018-02-12  1.533476  0.153282  0.206545 -1.705048  0.902248    1.533476
2018-02-13  0.644946  1.118433 -1.280884 -0.194192 -1.188405    0.644946
2018-02-14 -0.876035 -0.936199  0.650886  1.618296 -2.005351  777.000000
2018-02-15 -0.681884 -1.656915  1.180431  0.656743 -0.245139  777.000000
2018-02-16 -0.193685  0.299342  0.147617 -0.512613 -1.865015  777.000000
2018-02-17 -0.054394  0.186607  1.347089 -0.572204 -1.834945  777.000000
2018-02-18  1.258097 -1.181241  0.862308  0.482663 -1.597929    1.258097
2018-02-19  1.422132 -0.715571  0.334874 -0.351590  0.400077    1.422132
2018-02-20 -0.871651  0.094475  1.234217 -1.164276 -0.168905  777.000000
2018-02-21  2.495601  1.359487  0.900387  2.121595  1.123492    2.495601
2018-02-22  1.492576 -0.599646  2.063791 -0.253191 -0.181825    1.492576
2018-02-23  0.226564  1.354138  1.809289 -0.147485  0.029990    0.226564
2018-02-24  1.162309  1.161849 -1.959014  0.172918 -0.050078    1.162309
2018-02-25 -1.737522  0.777248  0.184540  1.296411  2.085795  777.000000
2018-02-26  0.005890 -0.371873 -2.600079  0.437064 -0.907263    0.005890
2018-02-27 -0.145344  0.551780 -0.640607 -0.558058  0.682098  777.000000
2018-02-28 -1.168728  0.758965 -0.015170  0.137205 -0.896786  777.000000
2018-03-01  0.461175  1.145675  0.621599 -0.534473 -1.112760    0.461175

### 2.7.3. Dados únicos

In [510]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index = list(range(4)), dtype= 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python',
                    'G': [2, 2, 4, 4],
                    'H': [np.nan, 2, 4, np.nan]
    
})

In [511]:
df2

     A          B    C  D      E       F  G    H
0  1.0 2013-01-02  1.0  3   test  Python  2  NaN
1  1.0 2013-01-02  1.0  3  train  Python  2  2.0
2  1.0 2013-01-02  1.0  3   test  Python  4  4.0
3  1.0 2013-01-02  1.0  3  train  Python  4  NaN

Sempre que usar a função nunique ela aponta os dados ÚNICOS ( axis=0 está relacionado a linha e axis= 1 à coluna)

In [514]:
df2.nunique(axis = 1, dropna = True)

0    6
1    6
2    6
3    6
dtype: int64